7767517
49 57
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=1728 9=1
Pooling                  maxpool2d_27             1 1 1 2 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=0
Convolution              convrelu_1               1 1 2 3 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Split                    splitncnn_0              1 2 3 4 5
Convolution              convrelu_3               1 1 5 6 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_2               1 1 4 7 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_0                    2 1 6 7 8 0=0
Convolution              convrelu_4               1 1 8 9 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
Split                    splitncnn_1              1 2 9 10 11
Convolution              convrelu_6               1 1 11 12 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              convrelu_5               1 1 10 13 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Concat                   cat_1                    2 1 12 13 14 0=0
Pooling                  maxpool2d_28             1 1 14 15 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=0
Convolution              convrelu_7               1 1 15 16 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split                    splitncnn_2              1 2 16 17 18
Convolution              convrelu_9               1 1 18 19 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_8               1 1 17 20 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_2                    2 1 19 20 21 0=0
Convolution              convrelu_10              1 1 21 22 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_3              1 2 22 23 24
Convolution              convrelu_12              1 1 24 25 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              convrelu_11              1 1 23 26 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Concat                   cat_3                    2 1 25 26 27 0=0
Pooling                  maxpool2d_29             1 1 27 28 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=0
Convolution              convrelu_13              1 1 28 29 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288 9=1
Split                    splitncnn_4              1 2 29 30 31
Convolution              convrelu_15              1 1 31 32 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_14              1 1 30 33 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Concat                   cat_4                    2 1 32 33 34 0=0
Convolution              convrelu_16              1 1 34 35 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
Split                    splitncnn_5              1 2 35 36 37
Convolution              convrelu_18              1 1 37 38 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Convolution              convrelu_17              1 1 36 39 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Concat                   cat_5                    2 1 38 39 40 0=0
Convolution              convrelu_19              1 1 40 41 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576 9=1
Split                    splitncnn_6              1 2 41 42 43
Convolution              convrelu_21              1 1 43 44 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_20              1 1 42 45 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Concat                   cat_6                    2 1 44 45 46 0=0
Convolution              convrelu_22              1 1 46 47 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Split                    splitncnn_7              1 2 47 48 49
Convolution              convrelu_24              1 1 49 50 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              convrelu_23              1 1 48 51 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Concat                   cat_7                    2 1 50 51 52 0=0
Convolution              convrelu_25              1 1 52 53 0=1000 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512000 9=1
Pooling                  gap_0                    1 1 53 54 0=1 4=1
Reshape                  reshape_56               1 1 54 55 0=1 1=1 2=-1
Flatten                  flatten_57               1 1 55 out0
